In [53]:
#기본적인 사칙연산
print(10+5)

15

In [54]:
print("hello" + "world")

helloworld

In [55]:
input_one = "Hello World"
input_one = 1234

print(input_one)

1234

In [56]:
#Bool 타입의 데이터 -> 조건문, 반복문 주로 사용
bool_str = True
bool_str_2 = False

In [57]:
#float
float_num = 3.14

In [58]:
# 튜플 ()
# 가장 기본적인 리스트의 형태
# 데이터의 수정 불가
tuple_num = (1,2,3,4)
print(tuple_num)
# 3을 출력하려면?
print(tuple_num[2])

(1, 2, 3, 4)
3

In [59]:
tuple_num_2 = ((1,2,3), (4,5,6))
print(tuple_num_2)
#5라는 숫자만 출력을 하고 싶으면?
print(tuple_num_2[1])  # -> (4,5,6)
print(tuple_num_2[1][1]) # -> 5

((1, 2, 3), (4, 5, 6))
(4, 5, 6)
5

In [60]:
# 리스트 []
# 리스트와 튜플의 차이는? -> 데이터의 수정이 가능 유무
list_num = [1,2,3,4,"a"]
print(list_num)

[1, 2, 3, 4, 'a']

In [61]:
# 딕셔너리 {}
# {'key1':'value1', 'key2':'value2'}

dict_num = {"name" : "test", "phone":"01012345678"}
# test를 출력하려면?
print(dict_num["name"])

test

In [62]:
# 조건문 if 조건식:
a = 5
if a > 8:
    print("a는 8보다 크다")
else:
    print("a는 8보다 작다")

a는 8보다 작다

In [63]:
b = ""
if b:   #b의 값이 존재하면
    print("성공")
else:   #b의 값이 존재하지 않으면
    print("실패")

실패

In [64]:
# 반복문 for문, while문
for i in range(1,10,1):
    print("%d 번째 반복" %i)   #%d -> 정수, %s -> 문자, %f -> 실수

1 번째 반복
2 번째 반복
3 번째 반복
4 번째 반복
5 번째 반복
6 번째 반복
7 번째 반복
8 번째 반복
9 번째 반복

In [65]:
dict_list = [{"name" : "test1", "password" : "1234"},
            {"name" : "test2", "password" : "1234"},
            {"name" : "test3", "password" : "1234"},]

# list형태의 데이터를 각항별로 순서대로 출력하는 for문
for i in range(len(dict_list)):
    print(dict_list[i]["name"])

test1
test2
test3

In [66]:
for i in dict_list:
    print(i["name"])

test1
test2
test3

In [67]:
i = 0
while i < len(dict_list):
    print(dict_list[i])
    i += 1

{'name': 'test1', 'password': '1234'}
{'name': 'test2', 'password': '1234'}
{'name': 'test3', 'password': '1234'}

In [68]:
# 함수 def 함수명(매개변수, 매개변수):
# 함수를 호출 -> 함수명(인자, 인자)
# 함수를 만들어봅시다. -> 함수를 호출 -> dict_list print-> 
# 인자값에 키값을 넣어주고 -> 그 키 값에 해당하는 값만 출력이 되도록
def func_1(input_key):
    for i in range(0, len(dict_list), 1):
        print(dict_list[i][input_key])

func_1("password")  # -> def  func_1("password")  -> print(list["password"])

1234
1234
1234

In [69]:
def func_2(list, input_key):
    i = 0
    while i < len(list):
        print(list[i][input_key])
        i += 1

func_2(dict_list, "name")

test1
test2
test3

In [70]:
def func_3():
    return "Hello"

print(func_3())

Hello

In [71]:
a = 10  # a는 전역변수? 지역변수? -> 전역변수

def func_4(input_a, input_b):
    result = input_a + input_b  # result -> 지역변수
    return result

print(func_4(5, 6))

11

In [72]:
def func_5():
    a = 15
    def func_6():
        print(a)
    func_6()

func_5()

15

In [73]:
# 함수를 생성 -> 매개변수 3개 -> def 함수1(a,b,c): -> 
# 함수 안에 함수를 하나 더 생성 -> 함수1 -> a+b -> 
# 함수2 -> a+b더해준 값에 c를 빼주는 함수를 만들어봅시다

def func_7(a, b, c):
    sum = a+b

    def func_8():
        result = sum - c
        return result
    
    print(func_8())

func_7(1,2,3)

0

In [74]:
def func_9(input_a, input_b):
    sum = input_a + input_b
    return sum

def func_10(input_c, input_d, input_e):
    sum_2 = func_9(input_c, input_d)
    result = sum_2 - input_e
    return result

print(func_10(5,2,3))

4

In [83]:
# 함수 3개 생성
# 함수1 -> 두 수의 합
# 함수2 -> 두 수의 차
# 함수3 -> def 함수3(a,b,c): -> c의 값이 'S'면 함수1(a,b)
# c의 값이 'D'면 함수2(a,b) -> 호출 --> print(함수3)

def func_11(input_a, input_b):
    result_1 = input_a + input_b
    return result_1

def func_12(input_c, input_d):
    result_2 = input_c - input_d
    return result_2

def func_13(input_e, input_f, input_g):
    if input_g == "S":
        result_3 = func_11(input_e, input_f)
        print(result_3)
        return result_3
    elif input_g == "D":
        result_4 = func_12(input_e, input_f)
        print(result_4)
        return result_4
    else:
        return "Not Matched"

print(func_13(1,2,"S"))
# func_13(1,2,"S")

3
3

In [87]:
# 함수 -> 입력 2개 a ~ b , c = "짝수","홀수"
# c 값에 따라 a ~ b 사이의 홀수, 짝수 반환 
# 반환되는 값의 데이터형태는 자유

def func_14(input_a, input_b):
    _list = []
    for i in range(input_a, input_b+1, 1):
        if i % 2 == 0:
            _list.append(i)
    return _list

def func_15(input_a, input_b):
    _list = []
    for i in range(input_a, input_b+1, 1):
        if i % 2 == 1:
            _list.append(i)
    return _list

def func_16(input_a, input_b, input_c):
    if input_c == "짝수":
        return func_14(input_a, input_b)
    elif input_c == "홀수":
        return func_15(input_a, input_b)

# print(func_16(1, 10, "짝수"))
func_16(1,10,"홀수")

[2, 4, 6, 8, 10]

In [94]:

_list_2 = []

def func_17(input_a, input_b):
    for i in range(input_a, input_b+1, 1):
        if i % 2 == 0:
            # print(i)
            _list_2.append(i)

def func_18(input_a, input_b):
    for i in range(input_a, input_b+1, 1):
        if i % 2 == 1:
            # print(i)
            _list_2.append(i)

def func_19(input_a, input_b, input_c):
    if input_c == "짝수":
        func_17(input_a, input_b)
    elif input_c == "홀수":
        func_18(input_a, input_b)

# print(func_16(1, 10, "짝수"))
func_19(1,10,"홀수")
print(_list_2)

[1, 3, 5, 7, 9]

In [7]:
import pandas as pd

# index , column, value 지정 -> pd.DataFrame(value, index='index', column='column')

df_1 = pd.DataFrame(['a', 'b', 'c'], columns=['A'])
df_1

   A
0  a
1  b
2  c

In [8]:
df_1['B'] = ["A", "B", "C"]
df_1

   A  B
0  a  A
1  b  B
2  c  C

In [10]:
df_1['B'] = "A"
df_1

   A  B
0  a  A
1  b  A
2  c  A

In [11]:
df_1['A']

0    a
1    b
2    c
Name: A, dtype: object

In [12]:
df_1.A

0    a
1    b
2    c
Name: A, dtype: object

In [13]:
df_1

   A  B
0  a  A
1  b  A
2  c  A

In [14]:
df_1.columns = ["a", "b"]
df_1

   a  b
0  a  A
1  b  A
2  c  A

In [15]:
values = [["test1", "20000"], ["test2", "30000"], ['test3', "10000"]]
columns = ["name", "pay"]

df_2 = pd.DataFrame(values, columns=columns)
df_2

    name    pay
0  test1  20000
1  test2  30000
2  test3  10000

In [16]:
df_2.sort_values('pay')

    name    pay
2  test3  10000
0  test1  20000
1  test2  30000

In [17]:
df_2.sort_values('pay', ascending=False)

    name    pay
1  test2  30000
0  test1  20000
2  test3  10000

In [18]:
df_2.sort_index(ascending=False)

    name    pay
2  test3  10000
1  test2  30000
0  test1  20000

In [19]:
df_3 = df_2.copy()
df_3

    name    pay
0  test1  20000
1  test2  30000
2  test3  10000

In [21]:
df_4 = df_3.drop(["name"], axis=1)
df_4

     pay
0  20000
1  30000
2  10000

In [23]:
df_5 = df_3.drop([0], axis=0)
df_5

    name    pay
1  test2  30000
2  test3  10000

In [26]:
df_5.to_csv('../test.csv', encoding='utf-8')